# 리스트는 [ ]으로 둘러싸지만 튜플은 ( )으로 둘러싼다.
# 리스트는 그 값의 생성, 삭제, 수정이 가능하지만 튜플은 그 값을 바꿀 수 없다
# 리스트와 모습은 거의 비슷하지만 튜플에서는 리스트와 다른 2가지 차이점을 찾아볼 수 있다. t2 = (1,)처럼 단지 1개의 요소만을 가질 때는 요소 뒤에 콤마(,)를 반드시 붙여야 한다는 것
# t4 = 1, 2, 3처럼 괄호( )를 생략해도 무방하다는 점
t2 = (1,)
t3 = (1, 2, 3)
t4 = 1, 2, 3
t5 = ('a', 'b', ('ab', 'cd'))

print(t2,t3,t4,t5)
print('- 인덱싱')
t1 = (1, 2, 'a', 'b')
print(t1)
print(t1[1:])
print('- 튜플 더하기')
t1 = (1, 2, 'a', 'b')
t2 = (3, 4)
print(t1)
print(t2)
print(t1 + t2)
print('- 튜플 곱하기')
print(t2*2)
print('- 튜플 길이 구하기')
print(len(t1))